<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"7fe0c33a1f5bb1c7a8ecfd804ae70f278007dd5a5f7643d35d69182292b051e8","plan_job_ref":"Job API #1615 at https://github.com/coverage-robot/core/actions/runs/8457546652","plan_out_hash":"fb84fa7ce2b719492bb56afb8f31a504fdd087a0fc472f4548bd2998904af19b","plan_hash":"82a418dcbb226d8ff780a5b23fbaaa7faa4be9bdb8c511d3048d6049674e5b9e","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./services/api/infrastructure__ in the __prod__ workspace
With var files: `./services/api/infrastructure/prod.tfvars`
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.api.aws_lambda_function.api will be updated in-place
!~  resource "aws_lambda_function" "api" {
        id                             = "coverage-api-prod"
!~      last_modified                  = "2024-03-27T19:25:14.000+0000" -> (known after apply)
!~      source_code_hash               = "VfIeOfVw2X9EmNEKjKh/PpJRnV00Hs/KGDmmEVVE+1U=" -> "WvlGG1wJAb1Ozt1DgkGQY2dO17maAznZ/zmGjYx0flk="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.event_listener.aws_lambda_function.events will be updated in-place
!~  resource "aws_lambda_function" "events" {
        id                             = "coverage-api-event-listener-prod"
!~      last_modified                  = "2024-03-27T19:25:04.000+0000" -> (known after apply)
!~      source_code_hash               = "VfIeOfVw2X9EmNEKjKh/PpJRnV00Hs/KGDmmEVVE+1U=" -> "WvlGG1wJAb1Ozt1DgkGQY2dO17maAznZ/zmGjYx0flk="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.ref_metadata.aws_dynamodb_table.ref_metadata_table will be created
+   resource "aws_dynamodb_table" "ref_metadata_table" {
+       arn                         = (known after apply)
+       billing_mode                = "PROVISIONED"
+       deletion_protection_enabled = true
+       hash_key                    = "********************"
+       id                          = (known after apply)
+       name                        = "coverage-api-ref-metadata-prod"
+       range_key                   = "***"
+       read_capacity               = 3
+       stream_arn                  = (known after apply)
+       stream_label                = (known after apply)
+       stream_view_type            = (known after apply)
+       tags_all                    = (known after apply)
+       write_capacity              = 3

+       attribute {
+           name = "ref"
+           type = "S"
        }
+       attribute {
+           name = "repositoryIdentifier"
+           type = "S"
        }
    }

  # module.webhook_handler.aws_lambda_function.webhooks will be updated in-place
!~  resource "aws_lambda_function" "webhooks" {
        id                             = "coverage-api-webhook-handler-prod"
!~      last_modified                  = "2024-03-27T19:25:26.000+0000" -> (known after apply)
!~      source_code_hash               = "VfIeOfVw2X9EmNEKjKh/PpJRnV00Hs/KGDmmEVVE+1U=" -> "WvlGG1wJAb1Ozt1DgkGQY2dO17maAznZ/zmGjYx0flk="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [API #1615](https://github.com/coverage-robot/core/actions/runs/8457546652)